tap "artginzburg/tap"
tap "homebrew/services"
brew "gnupg"
brew "lazygit"
brew "neofetch"
brew "node"
brew "pinentry-mac"
brew "python@3.12"
brew "starship"
brew "artginzburg/tap/sudo-touchid"
cask "bitwarden"
cask "blender"
cask "discord"
cask "firefox@developer-edition"
cask "iterm2"
cask "karabiner-elements"
cask "qflipper"
cask "sonos"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
vscode "adityavm.vscode-monokai-seti"
vscode "aryanahire.sublime-monokai"
vscode "aytee17.vscode-oceanic-next-sublime"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "christophwolff.sublime-oceanic-after-next-theme"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "emilijanmb.sublime-exact-theme"
vscode "emilijanmb.sublime-text-4-theme"
vscode "enubia.sublime-text-4-colorful-theme"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "file-icons.file-icons"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "grafana.grafana-alloy"
vscode "jprestidge.theme-material-theme"
vscode "markusylisiurunen.githubdarkmode"
vscode "maximetinu.identical-sublime-monokai-csharp-theme-colorizer"
vscode "mightbesimon.mariana-sublime"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nextbook.file-and-folder-icons"
vscode "piousdeer.adwaita-theme"
vscode "pkief.material-icon-theme"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryanolsonx.solarized"
vscode "samuelcolvin.jinjahtml"
vscode "subc4i.sublime-mavensmate-monokai-apex"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "wraith13.zoombar-vscode"
vscode "xmorse.dark-theme-github"
vscode "zhuangtongfa.material-theme"
