tap "artginzburg/tap"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "smartthingscommunity/smartthings"
brew "cmake"
brew "create-dmg"
brew "docker", link: false
brew "gh"
brew "gnupg"
brew "pkgconf"
brew "iperf3"
brew "lazygit"
brew "mas"
brew "nasm"
brew "neofetch"
brew "nmap"
brew "node"
brew "pinentry-mac"
brew "python@3.12"
brew "qemu"
brew "starship"
brew "thefuck"
brew "artginzburg/tap/sudo-touchid"
brew "jeffreywildman/virt-manager/virt-viewer"
brew "smartthingscommunity/smartthings/smartthings"
cask "bitwarden"
cask "blender"
cask "discord"
cask "docker-desktop"
cask "dolphin"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "google-earth-pro"
cask "gstreamer-runtime"
cask "iterm2"
cask "karabiner-elements"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "openvpn-connect"
cask "qflipper"
cask "sonos"
cask "sony-ps-remote-play"
cask "spotify"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "utm"
cask "virtualbox"
cask "visual-studio-code"
cask "wine-stable"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Prime Video", id: 545519333
vscode "andrewmarkle.primer-light"
vscode "aytee17.vscode-oceanic-next-sublime"
vscode "beardedbear.beardedtheme"
vscode "calvein.oceanicnext-light"
vscode "christophwolff.sublime-oceanic-after-next-theme"
vscode "claeri27.oceanic-plus-plus"
vscode "dan-c-underwood.arm"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eriklynd.json-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "markusylisiurunen.githubdarkmode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "qubitsphere.mariana-vscode-theme"
vscode "redhat.vscode-yaml"
vscode "ryanolsonx.solarized"
vscode "samuelcolvin.jinjahtml"
vscode "sleistner.vscode-fileutils"
vscode "tamasfe.even-better-toml"
vscode "wraith13.zoombar-vscode"
vscode "xmorse.dark-theme-github"
